_orgs/_posts/database/2014-12-14-install-oracle-on-linux.org
#+TITLE:    Install Oracle Database 12c On CentOS7
#+AUTHOR:   Rengui Zhao
#+EMAIL:    zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+BEGIN_EXPORT HTML
---
layout: post
title: Install Oracle Database 12c On CentOS7
author: zrg
comments: false
description: Install Oracle.
categories:
- Database
tags:
- Oracle
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

#+BEGIN_CENTER 
  Don't forget to answer the sum up questions in your email message!
#+END_CENTER 

* Write in front
: In this tutorial, we will show you how to Install Oracle Database 12c On CentOS 7.
* Environment
** OS information
: [root@1 ~]# cat /etc/centos-release
: CentOS Linux release 7.1.1503 (Core)
** Linux Kernel Version
: Linux  3.10.0
** Software Version
: Oracle 12.1.0‘
* Prepare
** Login as root and add required groups
: /usr/sbin/groupadd -g 501 oinstall
: /usr/sbin/groupadd -g 502 dba
: /usr/sbin/groupadd -g 503 oper'
** Add user oracle
: /usr/sbin/useradd -u 502 -g oinstall -G dba,oper oracle
** Change password of user:
: passwd oracle
** Add kernel parameters to /etc/sysctl.conf
: kernel.shmmni = 4096
: kernel.shmmax = 4398046511104
: kernel.shmall = 1073741824
: kernel.sem = 250 32000 100 128
: fs.aio-max-nr = 1048576
: fs.file-max = 6815744
: net.ipv4.ip_local_port_range = 9000 65500
: net.core.rmem_default = 262144
: net.core.rmem_max = 4194304
: net.core.wmem_default = 262144
: net.core.wmem_max = 1048586
** Apply kernel parameters
: /sbin/sysctl -p
** Add following lines to set shell limits for user oracle in file /etc/security/limits.conf
: oracle   soft   nproc    131072
: oracle   hard   nproc    131072
: oracle   soft   nofile   131072
: oracle   hard   nofile   131072
: oracle   soft   core     unlimited
: oracle   hard   core     unlimited
: oracle   soft   memlock  50000000
: oracle   hard   memlock  50000000
** Edit /etc/hosts file:
: [root@1 ~]# cat /etc/hosts
: 127.0.0.1   localhost localhost.localdomain localhost4 localhost4.localdomain4
: ::1         localhost localhost.localdomain localhost6 localhost6.localdomain6
: 192.168.120.166 ora-c7.zhao.local
** Verify your network setting:
: ping -c 1 ora-c7.zhao.local
** Modify .bash_profile for user oracle in his home directory add at the end file /home/oralce/.bash_profile.
: # Oracle Settings
: #Oracle Settings
: export TMP=/tmp
: export TMPDIR=$TMP
: 
: export ORACLE_HOSTNAME=O7-unixmen
: export ORACLE_UNQNAME=orcl
: export ORACLE_BASE=/u01/app/oracle
: export ORACLE_HOME=$ORACLE_BASE/product/12.1.0/db_1
: export ORACLE_SID=orcl

: export PATH=/usr/sbin:$PATH
: export PATH=$ORACLE_HOME/bin:$PATH

: export LD_LIBRARY_PATH=$ORACLE_HOME/lib:/lib:/usr/lib
: export CLASSPATH=$ORACLE_HOME/jlib:$ORACLE_HOME/rdbms/jlib
** Check which packages are installed and which are missing.as root copy this and excute this:
: yum groupinstall "GNOME Desktop" -y
: yum groupinstall "Development Tools" -y
: 
: yum install binutils -y
: yum install compat-libstdc++-33 -y
: yum install compat-libstdc++-33.i686 -y
: yum install gcc -y
: yum install gcc-c++ -y
: yum install glibc -y
: yum install glibc.i686 -y
: yum install glibc-devel -y
: yum install glibc-devel.i686 -y
: yum install ksh -y
: yum install libgcc -y
: yum install libgcc.i686 -y
: yum install libstdc++ -y
: yum install libstdc++.i686 -y
: yum install libstdc++-devel -y
: yum install libstdc++-devel.i686 -y
: yum install libaio -y
: yum install libaio.i686 -y
: yum install libaio-devel -y
: yum install libaio-devel.i686 -y
: yum install libXext -y
: yum install libXext.i686 -y
: yum install libXtst -y
: yum install libXtst.i686 -y
: yum install libX11 -y
: yum install libX11.i686 -y
: yum install libXau -y
: yum install libXau.i686 -y
: yum install libxcb -y
: yum install libxcb.i686 -y
: yum install libXi -y
: yum install libXi.i686 -y
: yum install make -y
: yum install sysstat -y
: yum install unixODBC -y
: yum install unixODBC-devel -y
: yum install zlib-devel -y
** Create directory strucrure
: mkdir -p   /u01/app/oracle/product/12.1.0
: chown  -R oracle:oinstall /u01/
: chmod  775 /u01/app
** Disable selinux  by editing the “/etc/selinux/config” file
: SELINUX=permissive
: or SELINUX=disabled
* Start Install database
** Let’s start with database software installation as oracle user.
: su - oracle
** Unzip the database install files:
: unzip linuxamd64_12c_database_1of2.zip
: unzip linuxamd64_12c_database_2of2.zip 
: [oracle@ora-c7 ~]$ cd  database/
** Install
: ./runInstaller
: 
: !!!This moment,there is a error:
: This is root...
: Introducing it in the back section.
: 
: This does not show the graphical interface for the installation.
* Problem Solving
** Error in invoking target '...' of makefile '/u01/...'
: Solving method:
: 
** Oracle Net Configure Assistant failed
#+BEGIN_SRC emacs-lisp
 Solving method：
 to: http://linux.linuxidc.com/,user and password is www.linuxidc.com
 download: /2012年资料/8月/28日/Oracle 11gR2执行DBCA报错误 
 
 Confirm ORACLE_HOME:echo $ORACLE_HOME
 
 Check perl version:perl -v
 
 Verify the OUI Inventory:opatch lsinventory
 //若没有将opath的路径加入到oralce用户的PATH变量中，也可以使用以下命令：$/u01/app/oracle/product/11.2.0/db_1/OPatch/opatch lsinventory
 !opatch command is in '$ORACLE_HOME/OPatch/',环境变量PATH中没有包含该目录的话,直接敲入opatch命令是提示找不到改命令的,这时需要将该目录加入到PATH中. 
 
 cd 8670579
 opatch apply //在8670579下执行
 
 ! opatch命令是在$ORACLE_HOME/OPatch/目录下,环境变量PATH中没有包含该目录的话,直接敲入opatch命令是提示找不到改命令的,这时需要将该目录加入到PATH中. 
#+END_SRC
** Oracle Database Configure Assistant failed
: 
: 
: 
: 
: 
: 
* Reference material
: http://www.tecmint.com/oracle-12c-installation-in-centos-6/
: http://www.unixmen.com/install-oracle-database-12c-centos-7/
: http://www.tuicool.com/articles/63mYBjN
: http://blog.itpub.net/25851087/viewspace-1419440/
