_posts/database/2014-12-14-install-oracle-on-linux.html
---
layout: post
title: Install Oracle Database 12c On CentOS7
author: zrg
comments: false
description: Install Oracle.
categories:
- Database
tags:
- Oracle
photos:
---

<div class="org-center">
<p>
Don't forget to answer the sum up questions in your email message!
</p>
</div>

<div id="outline-container-org805a798" class="outline-2">
<h2 id="org805a798">Write in front</h2>
<div class="outline-text-2" id="text-org805a798">
<pre class="example">
In this tutorial, we will show you how to Install Oracle Database 12c On CentOS 7.

</pre>
</div>
</div>
<div id="outline-container-org31aca8a" class="outline-2">
<h2 id="org31aca8a">Environment</h2>
<div class="outline-text-2" id="text-org31aca8a">
</div>
<div id="outline-container-org400119f" class="outline-3">
<h3 id="org400119f">OS information</h3>
<div class="outline-text-3" id="text-org400119f">
<pre class="example">
[root@1 ~]# cat /etc/centos-release
CentOS Linux release 7.1.1503 (Core)

</pre>
</div>
</div>
<div id="outline-container-orgd89b494" class="outline-3">
<h3 id="orgd89b494">Linux Kernel Version</h3>
<div class="outline-text-3" id="text-orgd89b494">
<pre class="example">
Linux  3.10.0

</pre>
</div>
</div>
<div id="outline-container-orga61aa9e" class="outline-3">
<h3 id="orga61aa9e">Software Version</h3>
<div class="outline-text-3" id="text-orga61aa9e">
<pre class="example">
Oracle 12.1.0‘

</pre>
</div>
</div>
</div>
<div id="outline-container-org07923bc" class="outline-2">
<h2 id="org07923bc">Prepare</h2>
<div class="outline-text-2" id="text-org07923bc">
</div>
<div id="outline-container-orge66de34" class="outline-3">
<h3 id="orge66de34">Login as root and add required groups</h3>
<div class="outline-text-3" id="text-orge66de34">
<pre class="example">
/usr/sbin/groupadd -g 501 oinstall
/usr/sbin/groupadd -g 502 dba
/usr/sbin/groupadd -g 503 oper'

</pre>
</div>
</div>
<div id="outline-container-org09c1599" class="outline-3">
<h3 id="org09c1599">Add user oracle</h3>
<div class="outline-text-3" id="text-org09c1599">
<pre class="example">
/usr/sbin/useradd -u 502 -g oinstall -G dba,oper oracle

</pre>
</div>
</div>
<div id="outline-container-orgbe959e5" class="outline-3">
<h3 id="orgbe959e5">Change password of user:</h3>
<div class="outline-text-3" id="text-orgbe959e5">
<pre class="example">
passwd oracle

</pre>
</div>
</div>
<div id="outline-container-org6127a9e" class="outline-3">
<h3 id="org6127a9e">Add kernel parameters to /etc/sysctl.conf</h3>
<div class="outline-text-3" id="text-org6127a9e">
<pre class="example">
kernel.shmmni = 4096
kernel.shmmax = 4398046511104
kernel.shmall = 1073741824
kernel.sem = 250 32000 100 128
fs.aio-max-nr = 1048576
fs.file-max = 6815744
net.ipv4.ip_local_port_range = 9000 65500
net.core.rmem_default = 262144
net.core.rmem_max = 4194304
net.core.wmem_default = 262144
net.core.wmem_max = 1048586

</pre>
</div>
</div>
<div id="outline-container-org280c0f3" class="outline-3">
<h3 id="org280c0f3">Apply kernel parameters</h3>
<div class="outline-text-3" id="text-org280c0f3">
<pre class="example">
/sbin/sysctl -p

</pre>
</div>
</div>
<div id="outline-container-org8d8285f" class="outline-3">
<h3 id="org8d8285f">Add following lines to set shell limits for user oracle in file /etc/security/limits.conf</h3>
<div class="outline-text-3" id="text-org8d8285f">
<pre class="example">
oracle   soft   nproc    131072
oracle   hard   nproc    131072
oracle   soft   nofile   131072
oracle   hard   nofile   131072
oracle   soft   core     unlimited
oracle   hard   core     unlimited
oracle   soft   memlock  50000000
oracle   hard   memlock  50000000

</pre>
</div>
</div>
<div id="outline-container-org547bd85" class="outline-3">
<h3 id="org547bd85">Edit /etc/hosts file:</h3>
<div class="outline-text-3" id="text-org547bd85">
<pre class="example">
[root@1 ~]# cat /etc/hosts
127.0.0.1   localhost localhost.localdomain localhost4 localhost4.localdomain4
::1         localhost localhost.localdomain localhost6 localhost6.localdomain6
192.168.120.166 ora-c7.zhao.local

</pre>
</div>
</div>
<div id="outline-container-org9d133d7" class="outline-3">
<h3 id="org9d133d7">Verify your network setting:</h3>
<div class="outline-text-3" id="text-org9d133d7">
<pre class="example">
ping -c 1 ora-c7.zhao.local

</pre>
</div>
</div>
<div id="outline-container-org00f3225" class="outline-3">
<h3 id="org00f3225">Modify .bash_profile for user oracle in his home directory add at the end file <i>home/oralce</i>.bash_profile.</h3>
<div class="outline-text-3" id="text-org00f3225">
<pre class="example">
# Oracle Settings
#Oracle Settings
export TMP=/tmp
export TMPDIR=$TMP

export ORACLE_HOSTNAME=O7-unixmen
export ORACLE_UNQNAME=orcl
export ORACLE_BASE=/u01/app/oracle
export ORACLE_HOME=$ORACLE_BASE/product/12.1.0/db_1
export ORACLE_SID=orcl

</pre>

<pre class="example">
export PATH=/usr/sbin:$PATH
export PATH=$ORACLE_HOME/bin:$PATH

</pre>

<pre class="example">
export LD_LIBRARY_PATH=$ORACLE_HOME/lib:/lib:/usr/lib
export CLASSPATH=$ORACLE_HOME/jlib:$ORACLE_HOME/rdbms/jlib

</pre>
</div>
</div>
<div id="outline-container-org0f1a797" class="outline-3">
<h3 id="org0f1a797">Check which packages are installed and which are missing.as root copy this and excute this:</h3>
<div class="outline-text-3" id="text-org0f1a797">
<pre class="example">
yum groupinstall "GNOME Desktop" -y
yum groupinstall "Development Tools" -y

yum install binutils -y
yum install compat-libstdc++-33 -y
yum install compat-libstdc++-33.i686 -y
yum install gcc -y
yum install gcc-c++ -y
yum install glibc -y
yum install glibc.i686 -y
yum install glibc-devel -y
yum install glibc-devel.i686 -y
yum install ksh -y
yum install libgcc -y
yum install libgcc.i686 -y
yum install libstdc++ -y
yum install libstdc++.i686 -y
yum install libstdc++-devel -y
yum install libstdc++-devel.i686 -y
yum install libaio -y
yum install libaio.i686 -y
yum install libaio-devel -y
yum install libaio-devel.i686 -y
yum install libXext -y
yum install libXext.i686 -y
yum install libXtst -y
yum install libXtst.i686 -y
yum install libX11 -y
yum install libX11.i686 -y
yum install libXau -y
yum install libXau.i686 -y
yum install libxcb -y
yum install libxcb.i686 -y
yum install libXi -y
yum install libXi.i686 -y
yum install make -y
yum install sysstat -y
yum install unixODBC -y
yum install unixODBC-devel -y
yum install zlib-devel -y

</pre>
</div>
</div>
<div id="outline-container-org2c8d184" class="outline-3">
<h3 id="org2c8d184">Create directory strucrure</h3>
<div class="outline-text-3" id="text-org2c8d184">
<pre class="example">
mkdir -p   /u01/app/oracle/product/12.1.0
chown  -R oracle:oinstall /u01/
chmod  775 /u01/app

</pre>
</div>
</div>
<div id="outline-container-org526450d" class="outline-3">
<h3 id="org526450d">Disable selinux  by editing the “/etc/selinux/config” file</h3>
<div class="outline-text-3" id="text-org526450d">
<pre class="example">
SELINUX=permissive
or SELINUX=disabled

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc4d599" class="outline-2">
<h2 id="orgcc4d599">Start Install database</h2>
<div class="outline-text-2" id="text-orgcc4d599">
</div>
<div id="outline-container-org0da573d" class="outline-3">
<h3 id="org0da573d">Let’s start with database software installation as oracle user.</h3>
<div class="outline-text-3" id="text-org0da573d">
<pre class="example">
su - oracle

</pre>
</div>
</div>
<div id="outline-container-org37d4f6e" class="outline-3">
<h3 id="org37d4f6e">Unzip the database install files:</h3>
<div class="outline-text-3" id="text-org37d4f6e">
<pre class="example">
unzip linuxamd64_12c_database_1of2.zip
unzip linuxamd64_12c_database_2of2.zip 
[oracle@ora-c7 ~]$ cd  database/

</pre>
</div>
</div>
<div id="outline-container-org5d2b8ac" class="outline-3">
<h3 id="org5d2b8ac">Install</h3>
<div class="outline-text-3" id="text-org5d2b8ac">
<pre class="example">
./runInstaller

!!!This moment,there is a error:
This is root...
Introducing it in the back section.

This does not show the graphical interface for the installation.

</pre>
</div>
</div>
</div>
<div id="outline-container-org72e0050" class="outline-2">
<h2 id="org72e0050">Problem Solving</h2>
<div class="outline-text-2" id="text-org72e0050">
</div>
<div id="outline-container-orgb340051" class="outline-3">
<h3 id="orgb340051">Error in invoking target '&#x2026;' of makefile '<i>u01</i>&#x2026;'</h3>
<div class="outline-text-3" id="text-orgb340051">
<pre class="example">
Solving method:


</pre>
</div>
</div>
<div id="outline-container-org8f13ef5" class="outline-3">
<h3 id="org8f13ef5">Oracle Net Configure Assistant failed</h3>
<div class="outline-text-3" id="text-org8f13ef5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">Solving method&#65306;
to: http://linux.linuxidc.com/,user and password is www.linuxidc.com
download: /2012&#24180;&#36164;&#26009;/8&#26376;/28&#26085;/Oracle 11gR2&#25191;&#34892;DBCA&#25253;&#38169;&#35823; 

Confirm ORACLE_HOME:echo $ORACLE_HOME

Check perl version:perl -v

Verify the OUI Inventory:opatch lsinventory
//&#33509;&#27809;&#26377;&#23558;opath&#30340;&#36335;&#24452;&#21152;&#20837;&#21040;oralce&#29992;&#25143;&#30340;PATH&#21464;&#37327;&#20013;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#20197;&#19979;&#21629;&#20196;&#65306;$/u01/app/oracle/product/11.2.0/db_1/OPatch/opatch lsinventory
!opatch command is in '$ORACLE_HOME/OPatch/',&#29615;&#22659;&#21464;&#37327;PATH&#20013;&#27809;&#26377;&#21253;&#21547;&#35813;&#30446;&#24405;&#30340;&#35805;,&#30452;&#25509;&#25970;&#20837;opatch&#21629;&#20196;&#26159;&#25552;&#31034;&#25214;&#19981;&#21040;&#25913;&#21629;&#20196;&#30340;,&#36825;&#26102;&#38656;&#35201;&#23558;&#35813;&#30446;&#24405;&#21152;&#20837;&#21040;PATH&#20013;. 

cd 8670579
opatch apply //&#22312;8670579&#19979;&#25191;&#34892;

! opatch&#21629;&#20196;&#26159;&#22312;$ORACLE_HOME/OPatch/&#30446;&#24405;&#19979;,&#29615;&#22659;&#21464;&#37327;PATH&#20013;&#27809;&#26377;&#21253;&#21547;&#35813;&#30446;&#24405;&#30340;&#35805;,&#30452;&#25509;&#25970;&#20837;opatch&#21629;&#20196;&#26159;&#25552;&#31034;&#25214;&#19981;&#21040;&#25913;&#21629;&#20196;&#30340;,&#36825;&#26102;&#38656;&#35201;&#23558;&#35813;&#30446;&#24405;&#21152;&#20837;&#21040;PATH&#20013;. 
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdecabe4" class="outline-3">
<h3 id="orgdecabe4">Oracle Database Configure Assistant failed</h3>
<div class="outline-text-3" id="text-orgdecabe4">
<pre class="example">







</pre>
</div>
</div>
</div>
<div id="outline-container-org1681657" class="outline-2">
<h2 id="org1681657">Reference material</h2>
<div class="outline-text-2" id="text-org1681657">
<pre class="example">
http://www.tecmint.com/oracle-12c-installation-in-centos-6/
http://www.unixmen.com/install-oracle-database-12c-centos-7/
http://www.tuicool.com/articles/63mYBjN
http://blog.itpub.net/25851087/viewspace-1419440/

</pre>
</div>
</div>
